blog-posts/2004-02-26-nifty-ideas-for-plannermode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nifty ideas for PlannerMode</title>
<!-- 2014-04-30 Wed 17:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Nifty ideas for PlannerMode</h1>
<p>
February 26th, 2004 -
<a href="http://sachachua.com/blog/p/1780"><a href="http://sachachua.com/blog/p/1780">http://sachachua.com/blog/p/1780</a></a>
</p>

<ul class="org-ul">
<li>A list of all the notes related to a BBDB contact. I'd have to parse
</li>
</ul>

<blockquote>
<p>
out all the bbdb links, covert them into canonical names and match
 them against the records, but it would be fun.
</p>
</blockquote>

<ul class="org-ul">
<li>General emacs-wiki hyperlinks.
</li>

<li>Recurring tasks.
</li>

<li>Ongoing projects and the next task in them. Upon task completion,
</li>
</ul>

<blockquote>
<p>
the next task in the project would be scheduled. Actually, this is
 already handled by future tasks, but this flexibility might be fun.
 Forces you to think of the next step.
</p>
</blockquote>

<ul class="org-ul">
<li>Monthly headlines in a calendar.
</li>

<li>Notes index by month, by year.
</li>

<li>timeclock integration into my Schedule.
</li>
</ul>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
